const string =
    'Lorem Ipsum является текст-заполнитель обычно используется в графических, печать и издательской индустрии для предварительного просмотра макета и визуальных макетах.';
let reversedString = '';

for (let i = string.length - 1; i >= 0; i--) {
    reversedString += string[i];
}

console.log(reversedString);
// .хатекам хыньлаузив и атекам артомсорп огоньлетиравдерп
// ялд ииртсудни йоксьлетадзи и ьтачеп ,хиксечифарг в ястеузьлопси ончыбо
// ьлетинлопаз-тскет ястеялвя muspI meroL
